; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; 4 Op-blocks world
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain BLOCKS)
  (:requirements :strips)
  (:predicates (on ?x ?y)
	       (ontable ?x)
	       (clear ?x)
	       (handempty)
	       (holding ?x)
	       )

  (:action pick-up
	     :parameters (?x)
	     :precondition (and (clear ?x) (ontable ?x) (handempty))
	     :effect
	     (and (not (ontable ?x))
		   (not (clear ?x))
		   (not (handempty))
		   (holding ?x)))

  (:action put-down
	     :parameters (?x)
	     :precondition (holding ?x)
	     :effect
	     (and (not (holding ?x))
		   (clear ?x)
		   (handempty)
		   (ontable ?x)))
  (:action stack
	     :parameters (?x ?y)
	     :precondition (and (holding ?x) (clear ?y))
	     :effect
	     (and (not (holding ?x))
		   (not (clear ?y))
		   (clear ?x)
		   (handempty)
		   (on ?x ?y)))
  (:action unstack
	     :parameters (?x ?y)
	     :precondition (and (on ?x ?y) (clear ?x) (handempty))
	     :effect
	     (and (holding ?x)
		   (clear ?y)
		   (not (clear ?x))
		   (not (handempty))
		   (not (on ?x ?y)))))

; problem
(define (problem BLOCKS-10-0)
(:domain BLOCKS)
(:objects D A H G B J E I F C )
(:init (ontable i)(on j b)(on b g)(on g h)(on h a)(on a d)(on d i)(ontable c)(clear j)(on e c)(clear f)(handempty)(on f e))
(:goal (AND (ON D C) (ON C F) (ON F J) (ON J E) (ON E H) (ON H B) (ON B A)
            (ON A G) (ON G I)))
)

; plan
1. (unstack f e)
   deleted: (clear f) (handempty) (on f e)
   added: (holding f) (clear e)
   goals met: 0 of 9
2. (put-down f)
   deleted: (holding f)
   added: (clear f) (handempty) (ontable f)
   goals met: 0 of 9
3. (unstack j b)
   deleted: (clear j) (handempty) (on j b)
   added: (holding j) (clear b)
   goals met: 0 of 9
4. (stack j e)
   deleted: (holding j) (clear e)
   added: (clear j) (handempty) (on j e)
   goals met: 1 of 9
5. (pick-up f)
   deleted: (ontable f) (clear f) (handempty)
   added: (holding f)
   goals met: 1 of 9
6. (stack f j)
   deleted: (holding f) (clear j)
   added: (clear f) (handempty) (on f j)
   goals met: 2 of 9
7. (unstack b g)
   deleted: (clear b) (handempty) (on b g)
   added: (holding b) (clear g)
   goals met: 2 of 9
8. (put-down b)
   deleted: (holding b)
   added: (clear b) (handempty) (ontable b)
   goals met: 2 of 9
9. (unstack g h)
   deleted: (clear g) (handempty) (on g h)
   added: (holding g) (clear h)
   goals met: 2 of 9
10. (put-down g)
   deleted: (holding g)
   added: (clear g) (handempty) (ontable g)
   goals met: 2 of 9
11. (unstack h a)
   deleted: (clear h) (handempty) (on h a)
   added: (holding h) (clear a)
   goals met: 2 of 9
12. (stack h b)
   deleted: (holding h) (clear b)
   added: (clear h) (handempty) (on h b)
   goals met: 3 of 9
13. (unstack a d)
   deleted: (clear a) (handempty) (on a d)
   added: (holding a) (clear d)
   goals met: 3 of 9
14. (stack a g)
   deleted: (holding a) (clear g)
   added: (clear a) (handempty) (on a g)
   goals met: 4 of 9
15. (unstack d i)
   deleted: (clear d) (handempty) (on d i)
   added: (holding d) (clear i)
   goals met: 4 of 9
16. (put-down d)
   deleted: (holding d)
   added: (clear d) (handempty) (ontable d)
   goals met: 4 of 9
17. (unstack a g)
   deleted: (clear a) (handempty) (on a g)
   added: (holding a) (clear g)
   goals met: 3 of 9
18. (put-down a)
   deleted: (holding a)
   added: (clear a) (handempty) (ontable a)
   goals met: 3 of 9
19. (pick-up g)
   deleted: (ontable g) (clear g) (handempty)
   added: (holding g)
   goals met: 3 of 9
20. (stack g i)
   deleted: (holding g) (clear i)
   added: (clear g) (handempty) (on g i)
   goals met: 4 of 9
21. (pick-up a)
   deleted: (ontable a) (clear a) (handempty)
   added: (holding a)
   goals met: 4 of 9
22. (stack a g)
   deleted: (holding a) (clear g)
   added: (clear a) (handempty) (on a g)
   goals met: 5 of 9
23. (unstack h b)
   deleted: (clear h) (handempty) (on h b)
   added: (holding h) (clear b)
   goals met: 4 of 9
24. (put-down h)
   deleted: (holding h)
   added: (clear h) (handempty) (ontable h)
   goals met: 4 of 9
25. (pick-up b)
   deleted: (ontable b) (clear b) (handempty)
   added: (holding b)
   goals met: 4 of 9
26. (stack b a)
   deleted: (holding b) (clear a)
   added: (clear b) (handempty) (on b a)
   goals met: 5 of 9
27. (pick-up h)
   deleted: (ontable h) (clear h) (handempty)
   added: (holding h)
   goals met: 5 of 9
28. (stack h b)
   deleted: (holding h) (clear b)
   added: (clear h) (handempty) (on h b)
   goals met: 6 of 9
29. (unstack f j)
   deleted: (clear f) (handempty) (on f j)
   added: (holding f) (clear j)
   goals met: 5 of 9
30. (put-down f)
   deleted: (holding f)
   added: (clear f) (handempty) (ontable f)
   goals met: 5 of 9
31. (unstack j e)
   deleted: (clear j) (handempty) (on j e)
   added: (holding j) (clear e)
   goals met: 4 of 9
32. (put-down j)
   deleted: (holding j)
   added: (clear j) (handempty) (ontable j)
   goals met: 4 of 9
33. (unstack e c)
   deleted: (clear e) (handempty) (on e c)
   added: (holding e) (clear c)
   goals met: 4 of 9
34. (stack e h)
   deleted: (holding e) (clear h)
   added: (clear e) (handempty) (on e h)
   goals met: 5 of 9
35. (pick-up c)
   deleted: (ontable c) (clear c) (handempty)
   added: (holding c)
   goals met: 5 of 9
36. (stack c f)
   deleted: (holding c) (clear f)
   added: (clear c) (handempty) (on c f)
   goals met: 6 of 9
37. (pick-up d)
   deleted: (ontable d) (clear d) (handempty)
   added: (holding d)
   goals met: 6 of 9
38. (stack d c)
   deleted: (holding d) (clear c)
   added: (clear d) (handempty) (on d c)
   goals met: 7 of 9
39. (pick-up j)
   deleted: (ontable j) (clear j) (handempty)
   added: (holding j)
   goals met: 7 of 9
40. (stack j e)
   deleted: (holding j) (clear e)
   added: (clear j) (handempty) (on j e)
   goals met: 8 of 9
41. (unstack d c)
   deleted: (clear d) (handempty) (on d c)
   added: (holding d) (clear c)
   goals met: 7 of 9
42. (put-down d)
   deleted: (holding d)
   added: (clear d) (handempty) (ontable d)
   goals met: 7 of 9
43. (unstack c f)
   deleted: (clear c) (handempty) (on c f)
   added: (holding c) (clear f)
   goals met: 6 of 9
44. (put-down c)
   deleted: (holding c)
   added: (clear c) (handempty) (ontable c)
   goals met: 6 of 9
45. (pick-up d)
   deleted: (ontable d) (clear d) (handempty)
   added: (holding d)
   goals met: 6 of 9
46. (stack d c)
   deleted: (holding d) (clear c)
   added: (clear d) (handempty) (on d c)
   goals met: 7 of 9
47. (pick-up f)
   deleted: (ontable f) (clear f) (handempty)
   added: (holding f)
   goals met: 7 of 9
48. (stack f j)
   deleted: (holding f) (clear j)
   added: (clear f) (handempty) (on f j)
   goals met: 8 of 9
49. (unstack d c)
   deleted: (clear d) (handempty) (on d c)
   added: (holding d) (clear c)
   goals met: 7 of 9
50. (put-down d)
   deleted: (holding d)
   added: (clear d) (handempty) (ontable d)
   goals met: 7 of 9
51. (pick-up c)
   deleted: (ontable c) (clear c) (handempty)
   added: (holding c)
   goals met: 7 of 9
52. (stack c f)
   deleted: (holding c) (clear f)
   added: (clear c) (handempty) (on c f)
   goals met: 8 of 9
53. (pick-up d)
   deleted: (ontable d) (clear d) (handempty)
   added: (holding d)
   goals met: 8 of 9
54. (stack d c)
   deleted: (holding d) (clear c)
   added: (clear d) (handempty) (on d c)
   goals met: 9 of 9
